Revit 2026 API

# ColorFillSchemeEntryGetDoubleValue Method

---

Gets the Double value stored within the entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetDoubleValue()
```
```vb
Public Function GetDoubleValue As Double
```
```cpp
public:
double GetDoubleValue()
```
```fsharp
member GetDoubleValue : unit -> float
```

#### Return Value

Double The Double value contained in the entry.

This method should only be used if the StorageType property reports the type of the entry as a Double.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace